app/controllers/casos_controller.rb

SELECT "casos".* FROM "casos"
---
  def index
    @casos = Caso.all

INSERT INTO "casos" ("radicado", "nombreimplicado", "tribunal", "estado", "sala", "tipodecision", "segundainstancia", "magistradoponente", "bloque", "lugardeinfluencia", "lugarexpedicion", "fechaexpedicion", "estadoprovidencia", "secomunico", "fechacomunicacion", "delimitaciondeapartados", "ordenexhorto", "recomendaciones", "direcciongrupo", "tiempodeterminado", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20, $21, $22) RETURNING "id"
---
  def create
    @caso = Caso.new(caso_params)

    respond_to do |format|
      if @caso.save

UPDATE "casos" SET "nombreimplicado" = $1, "updated_at" = $2 WHERE "casos"."id" = $3  [["nombreimplicado", "<strong>asd</strong>"], ["updated_at", 2017-04-04 04:04:44 UTC], ["id", 1]]
---
  def update
    respond_to do |format|
      if @caso.update(caso_params)

SELECT  "casos".* FROM "casos" WHERE "casos"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_caso
      @caso = Caso.find(params[:id])