app/controllers/informes_controller.rb

  def create
    @informe = Informe.new(informe_params)

    respond_to do |format|
      if @informe.save
---
INSERT INTO "informes" ("idcaso", "fecha", "lugar", "resumen", "fechares", "descripcion", "entidad", "recirespo", "fechaentre", "entredescr", "entidadentre", "respondidoentre", "descripcionob", "cumplido", "fechaau", "descrup", "created_at", "updated_at", "fechaobs") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19) RETURNING "id"

    def set_informe
      @informe = Informe.find(params[:id])
---
SELECT  "informes".* FROM "informes" WHERE "informes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]